Catalogs/ШаблоныПроизвольныхКадровыхПриказов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>ШаблоныПроизвольныхКадровыхПриказов</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НесколькоСотрудников</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодписываетРуководитель</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодписываетГлавныйБухгалтер</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодписываетКассир</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодписываетРуководительКадровойСлужбы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодписываетБухгалтер</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоказыватьПодразделение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроверятьЗаполнениеПодразделения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВАрхиве</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ВнешниеПечатныеФормы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПечатнаяФорма</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДополнительныеОтчетыИОбработки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ШаблоныПроизвольныхКадровыхПриказов/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

#Область ОбработчикиПравилРегистрации

// См. ЗарплатаКадрыРасширенныйСинхронизацияДанных.ШаблонОбработчика
Процедура ПриЗаполненииНастроекОбработчиковПравилРегистрации(Настройки) Экспорт
	ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляРегламентированныхДанных(Настройки);
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция НастройкиВидаДокумента(Шаблон) Экспорт

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Шаблон", Шаблон);
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ШаблоныПроизвольныхКадровыхПриказов.Наименование,
		|	ШаблоныПроизвольныхКадровыхПриказов.НесколькоСотрудников,
		|	ШаблоныПроизвольныхКадровыхПриказов.ПодписываетРуководитель,
		|	ШаблоныПроизвольныхКадровыхПриказов.ПодписываетГлавныйБухгалтер,
		|	ШаблоныПроизвольныхКадровыхПриказов.ПодписываетКассир,
		|	ШаблоныПроизвольныхКадровыхПриказов.ПодписываетРуководительКадровойСлужбы,
		|	ШаблоныПроизвольныхКадровыхПриказов.ПодписываетБухгалтер,
		|	ШаблоныПроизвольныхКадровыхПриказов.ПоказыватьПодразделение,
		|	ШаблоныПроизвольныхКадровыхПриказов.ПроверятьЗаполнениеПодразделения
		|ИЗ
		|	Справочник.ШаблоныПроизвольныхКадровыхПриказов КАК ШаблоныПроизвольныхКадровыхПриказов
		|ГДЕ
		|	ШаблоныПроизвольныхКадровыхПриказов.Ссылка = &Шаблон";
	Возврат ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(Запрос.Выполнить().Выгрузить()[0]);
	
КонецФункции

// Предназначена для получения актуальных видов документов.
//
Функция ТаблицаВидовДокументов() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ШаблоныПроизвольныхКадровыхПриказов.Ссылка КАК ВидДокумента,
		|	ШаблоныПроизвольныхКадровыхПриказов.Наименование КАК Наименование,
		|	ШаблоныПроизвольныхКадровыхПриказов.Наименование КАК Представление,
		|	ШаблоныПроизвольныхКадровыхПриказов.Родитель
		|ИЗ
		|	Справочник.ШаблоныПроизвольныхКадровыхПриказов КАК ШаблоныПроизвольныхКадровыхПриказов
		|ГДЕ
		|	НЕ ШаблоныПроизвольныхКадровыхПриказов.ПометкаУдаления
		|	И НЕ ШаблоныПроизвольныхКадровыхПриказов.ЭтоГруппа
		|	И НЕ ШаблоныПроизвольныхКадровыхПриказов.ВАрхиве";
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Функция ПечатныеФормы() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВнешниеПечатныеФормы.ПечатнаяФорма,
		|	ВнешниеПечатныеФормы.Ссылка КАК ШаблонДокумента,
		|	ВнешниеПечатныеФормы.НомерСтроки КАК НомерСтроки
		|ИЗ
		|	Справочник.ШаблоныПроизвольныхКадровыхПриказов.ВнешниеПечатныеФормы КАК ВнешниеПечатныеФормы
		|УПОРЯДОЧИТЬ ПО
		|	Ссылка,
		|	НомерСтроки";
	Возврат Запрос.Выполнить().Выгрузить();

КонецФункции

#КонецОбласти

#КонецЕсли
